app/controllers/api/tweets_controller.rb

SELECT "tweets".* FROM "tweets" ORDER BY "tweets"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 2], ["id", 1]]
---
    def index
      @tweets = Tweet.includes(:user).order(created_at: :desc)

SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ? AND (created_at > '2024-12-05 09:43:58.023297')  [["user_id", 3]]
INSERT INTO "tweets" ("message", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "test"], ["user_id", 3], ["created_at", "2024-12-05 10:43:58.025671"], ["updated_at", "2024-12-05 10:43:58.025671"]]
---
    def create
      puts "Params received: #{params.inspect}"

      token = cookies.signed[:twitter_session_token]
      session = Session.find_by(token: token)
      user = session&.user

      return render json: { error: 'Unauthorized' }, status: :unauthorized unless user

      if user.tweets.where('created_at > ?', Time.now - 60.minutes).count >= 30
        return render json: { error: 'Rate limit exceeded (30 tweets/hour)' }, status: :too_many_requests
      end

      @tweet = user.tweets.new(message: params[:tweet][:message])

      if params[:tweet][:image].present?
        uploaded_file = params[:tweet][:image]
        puts "Uploaded file: #{uploaded_file.inspect}"

        begin
          @tweet.image.attach(
            io: uploaded_file.tempfile,
            filename: uploaded_file.original_filename,
            content_type: uploaded_file.content_type
          )

UPDATE "tweets" SET "updated_at" = ? WHERE "tweets"."id" = ?  [["updated_at", "2024-12-07 10:26:27.615219"], ["id", 28]]
---
        end
      end

      if @tweet.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ? AND "tweets"."id" = ? LIMIT ?  [["user_id", 3], ["id", 11], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 11]]
---
    def destroy
      token = cookies.signed[:twitter_session_token]
      session = Session.find_by(token: token)
      user = session&.user

      return render json: { success: false }, status: :unauthorized unless user

      tweet = user.tweets.find_by(id: params[:id])
      if tweet&.destroy