app/controllers/api/users_controller.rb

    def create
      Rails.logger.debug "Params received: #{params.inspect}"
      @user = User.new(user_params)

      if @user.save
---
INSERT INTO "users" ("username", "email", "created_at", "updated_at", "password_digest") VALUES (?, ?, ?, ?, ?)

    def show
      @user = User.find_by(username: params[:username])

      if @user
        render json: {
          username: @user.username,
          tweets: @user.tweets,
          following_count: @user.following.count,
          followers_count: @user.followers.count
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "testuser"], ["LIMIT", 1]]
SELECT COUNT(*) FROM "users" INNER JOIN "follows" ON "users"."id" = "follows"."followed_id" WHERE "follows"."follower_id" = ?  [["follower_id", 3]]

    def tweets
      user = User.find_by(username: params[:username])
      if user
        tweets = user.tweets.includes(:user).order(created_at: :desc)
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "testuser"], ["LIMIT", 1]]
SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ? ORDER BY "tweets"."created_at" DESC  [["user_id", 3]]