app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets" ORDER BY "tweets"."created_at" DESC
---
  def index
    @tweets = Tweet.all.order(created_at: :desc)

SELECT "tweets".* FROM "tweets" WHERE "tweets"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "tweets" WHERE "tweets"."user_id" = ? AND (created_at > '2024-09-03 10:16:12.616716')  [["user_id", 2]]
INSERT INTO "tweets" ("message", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["message", "Image upload"], ["user_id", 1], ["created_at", "2024-07-28 08:32:16.140596"], ["updated_at", "2024-07-28 08:32:16.140596"]]
---
  def create
    token = cookies.signed[:twitter_session_token]
    session = Session.find_by(token: token)
    user = session.user

    if user.tweets.where('created_at > ?', Time.now - 60.minutes).count >= 30
      return render json: {
        error: {
          message: 'Rate limit exceeded (30 tweets/hour). Please try agian later.'
        }
      }
    end

    @tweet = user.tweets.new(tweet_params)

    if @tweet.save

SELECT "tweets".* FROM "tweets" WHERE "tweets"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tweets" WHERE "tweets"."id" = ?  [["id", 2]]
---
  def destroy
    token = cookies.signed[:twitter_session_token]
    session = Session.find_by(token: token)

    return render json: { success: false } unless session

    user = session.user
    tweet = Tweet.find_by(id: params[:id])

    if tweet && (tweet.user == user) && tweet.destroy

SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "Test"], ["LIMIT", 1]]
---
  def index_by_user
    user = User.find_by(username: params[:username])